export default {
  link: {
    statistics: 'الإحصائيات',
    learnMore: 'تعرف علينا',
  },

  header: {
    whatIsNuha: 'تعرف على نهى',
    howItWorks: 'كيف يعمل',
  },

  intro: {
    text: 'اداة مراقبة تستخدم الذكاء الاصطناعي ',
    sub: 'لتصنيف خطاب الكراهية القائم على الجنس عبر الانترنت',
  },

  waitlist: {
    join: 'سجل مسبقا',
    enterEmail: 'ادخل بريدك الالكتروني',
    done: 'تم',
  },

  statistical: {
    info: 'تركز الجانب العام على الدعوة والحملات الفعالة ضد خطاب الكراهية عبر الإنترنت، وخاصة تلك التي تستهدف المرأة في الأماكن العامة في الأردن بما في ذلك ناشطات حقوق الإنسان والصحفيات والمؤثرات على وسائل التواصل الاجتماعي والنساء في البيانات الكمية. وبالتالي، ستقوم JOSA بتحديد ما لا يقل عن 100 ناشطة نسائية في الأردن بناءً على معيار اختيار محدد لحساباتهن على وسائل التواصل الاجتماعي (Facebook و Twitter) والهجمات التي تتعرض لها من خطاب الكراهية. سيقوم باحثو JOSA بجمع هذه البيانات باستخدام طرق مختلفة، وتصنيفها إلى فئات مختلفة مع مراعاة السلوك المحدد.',
    tooltip: {
      type: 'النوع',
      percentage: 'النسبة المئوية',
    },
  },
  data: {
    hateSpeech: 'خطاب الكراهية',
    positiveSpeech: 'خطاب إيجابي',
    unrelated: 'لا علاقة لها بالسياق',
    neutral: 'محايد',
  },
}
