export default {
  homeHero: {
    title: 'نهى',
    intro:
      '.أداة مفتوحة المصدر مدعمة بالذكاء الاصطناعي لمساعدة الباحثين في اكتشاف خطاب الكراهية القائم على الجنس باللغة العربية على الإنترنت',
    tryItOut: 'جربه الآن',
  },

  link: {
    statistics: 'الإحصائيات',
    learnMore: 'تعرف علينا',
  },

  header: {
    whatIsNuha: 'تعرف على نهى',
    howItWorks: 'كيف يعمل',
    login: 'تسجيل الدخول',
    userMenu: {
      dashboard: 'لوحة المراقبة',
      settings: 'الإعدادات',
      signOut: 'تسجيل الخروج',
    },
  },
  footer: {
    copyright: 'الجمعية الأردنية للمصدر المفتوح (جوسا) © 2021-2023',
    links: {
      about: 'عن المشروع',
      github: 'جيتهب',
      terms: 'الشروط والسياسات',
      privacy: 'سياسة الخصوصية',
    },
  },

  waitlist: {
    join: 'سجل مسبقا',
    enterEmail: 'ادخل بريدك الالكتروني',
    done: 'تم',
    close: 'أغلق',
    email: 'البريد الإلكتروني',
    send: {
      success: 'تم الإشتراك بنجاح!',
      fail: 'عفوا, حصل خلل ما! الرجاء المحاولة فيما بعد.',
    },
  },

  methodology: {
    title: 'المنهجية',
    description:
      'نماذج النصوص لدينا هي أدوات معالجة لغة متقدمة يمكنها إنشاء نص وتصنيفه وتلخيصه بمستويات عالية من التماسك والدقة.',
    aboutProject: 'حول هذا المشروع',
    aboutProjectDescription:
      'نهى، هو نظام ذكاء اصطناعي يهدف إلى اكتشاف وتصنيف خطاب الكراهية ضد المرأة في الفضاءات الرقمية، مثل منصات التواصل الاجتماعي. تمثل نهى، المشتقة من الكلمة العربية التي تعني "العقل" أو "الدماغ"، خطوة حاسمة إلى الأمام في معالجة القضية المنتشرة المتمثلة في خطاب الكراهية القائم على النوع الاجتماعي والتحيز الجنسي ضد المرأة.',
    detailed: 'المنهجية التفصيلية',
    detailedDescription:
      'يتم تدريب نموذج نهى باستخدام مجموعة بيانات تم الحصول عليها من خلال رصد 20 وسمًا رائجًا يتعلق بالمرأة والحركة النسوية في الأردن، بالإضافة إلى 83 اسمًا لناشطات ونساء مؤثرات في الأردن.',
    ethical: 'الاعتبارات الاخلاقية',
    ethicalDescription:
      'يتم تدريب نموذج نهى باستخدام مجموعة بيانات تم الحصول عليها من خلال رصد 20 وسمًا رائجًا يتعلق بالمرأة والحركة النسوية في الأردن، بالإضافة إلى 83 اسمًا لناشطات ونساء مؤثرات في الأردن.',
    content: 'المحتويات',
    figure: 'الشكل',
    footnotes: 'الحواشي',
    sections: {
      about: {
        title: 'حول هذا المشروع',
        firstParagraph: {
          title: 'ما هي نهى؟',
          p1: 'يطمح نظام نهى، وهو نظام ذكاء اصطناعي، إلى تحديد وتصنيف حالات خطاب الكراهية الموجه ضد المرأة بكفاءة في عالم المنصات الرقمية، وخاصة في مجال وسائل التواصل الاجتماعي. إن حل الذكاء الاصطناعي المبتكر هذا، الذي يحمل اسم "نهى" - وهو مستوحى من المعجم العربي، حيث ينقل جوهر "العقل" أو "الدماغ" - يمثل خطوة محورية في مواجهة مشكلة الكراهية الدائمة والمنتشرة المتمثلة في كراهية النساء والتحيز الجنسي. الكلام في الفضاء السيبراني.',
          p2: 'لقد بشر المشهد الرقمي المعاصر بعصر من الاتصال غير المسبوق ونشر المعلومات، مما أدى إلى إنشاء عالم افتراضي يلتقي فيه الأفراد من خلفيات متنوعة لتبادل الأفكار والآراء والخبرات. ولكن في هذا العالم الرقمي المتوسع، ظهرت ظاهرة مثيرة للقلق: انتشار خطاب الكراهية الموجه ضد النساء. يشكل هذا الشكل البغيض من التعبير انتهاكًا خطيرًا لحقوق الإنسان ويؤثر سلبًا على رفاهية المرأة ومشاركتها في المساحات عبر الإنترنت.',
          fig1: 'دورة حياة التعلم الآلي كما تم اعتمادها في نهى.',
        },
        secondParagraph: {
          title: 'كيف يمكن أن تكون نهى مفيدة للباحثين؟',
          p1: 'يؤكد ظهور نهى على الحاجة الماسة إلى مناهج شاملة تعتمد على التكنولوجيا لمواجهة التحدي المتزايد المتمثل في كراهية النساء على الإنترنت وخطاب الكراهية القائم على النوع الاجتماعي. إن اللغة التمييزية والعدائية، التي تستهدف النساء بشكل مباشر، لا تهدد السلامة العاطفية والنفسية لأهدافها فحسب، بل تعيق أيضًا قدرتهم على المشاركة الكاملة في الخطاب الرقمي. من أجل بناء فهم دقيق لأهمية نهى، من الضروري الخوض في الجوانب المتعددة الأوجه لتطويرها وتشغيلها، والتي تضرب بجذورها في الذكاء الاصطناعي المتطور ومعالجة اللغة الطبيعية.',
          p2: 'يستمد الإطار التأسيسي لنهى على نطاق واسع من مجال الذكاء الاصطناعي المتطور باستمرار، والذي يشمل مجموعة واسعة من خوارزميات التعلم الآلي، والشبكات العصبية، والمنهجيات المعتمدة على البيانات. تعتمد نهى في جوهرها على تقنيات التعلم الآلي المتقدمة لتمييز الأنماط والإشارات اللغوية والفروق الدقيقة في المحتوى الرقمي. يسمح هذا النهج لنهى بالتمييز بين التعبيرات الحميدة عن الرأي وخطاب الكراهية الذي يستهدف النساء بشكل مباشر، مما يوفر استجابة متطورة ومعتمدة على البيانات لأزمة التحرش عبر الإنترنت المستمرة على أساس الجنس.',
        },
        footnotes: {
          1: 'جون سميث، "تطورات الذكاء الاصطناعي في القرن الحادي والعشرين"، مجلة التقنيات الناشئة 45، العدد. 3 (2022): 67-82، دوى:10.1234/jet.2022.45.3.',
          2: 'جين دو، "الاعتبارات الأخلاقية في تطوير الذكاء الاصطناعي،" وقائع ندوة أخلاقيات الذكاء الاصطناعي (شيكاغو: مطبعة جامعة شيكاغو، 2021)، 112.',
        },
      },
      detailed: {
        title: 'المنهجية التفصيلية',
      },
      ethics: {
        title: 'الاعتبارات الاخلاقية',
      },
    },
  },

  statistical: {
    info: 'تركز الجانب العام على الدعوة والحملات الفعالة ضد خطاب الكراهية عبر الإنترنت، وخاصة تلك التي تستهدف المرأة في الأماكن العامة في الأردن بما في ذلك ناشطات حقوق الإنسان والصحفيات والمؤثرات على وسائل التواصل الاجتماعي والنساء في البيانات الكمية. وبالتالي، ستقوم JOSA بتحديد ما لا يقل عن 100 ناشطة نسائية في الأردن بناءً على معيار اختيار محدد لحساباتهن على وسائل التواصل الاجتماعي (Facebook و Twitter) والهجمات التي تتعرض لها من خطاب الكراهية. سيقوم باحثو JOSA بجمع هذه البيانات باستخدام طرق مختلفة، وتصنيفها إلى فئات مختلفة مع مراعاة السلوك المحدد.',
    tooltip: {
      type: 'النوع',
      percentage: 'النسبة المئوية',
    },
  },
  nuha: {
    title: 'من هي نهى؟',
    body: '“نهى” هو نظام ذكاء اصطناعي يهدف إلى الكشف عن الخطاب الكراهية وتصنيفه ضد النساء في المساحات الرقمية، مثل منصات التواصل الاجتماعي. يمثل “نهى”، والذي يستمد اسمه من الكلمة العربية لـ “العقل” أو “الدماغ”، خطوة حاسمة نحو معالجة المشكلة المنتشرة للغاية من خطاب الكراهية الجنساني والجنسي ضد النساء في الإنترنت.',
    work: {
      title: ' كيف تعمل؟ ',
      body: 'يتم تدريب نموذج نهى باستخدام مجموعة بيانات تم الحصول عليها من خلال مراقبة 20 وسمًا رائجًا يتعلق بالنساء والحركة النسوية في الأردن ، بالإضافة إلى 83 اسمًا لناشطات النساء والمؤثرات النسائيات في الأردن. تم جمع مجموعة البيانات من 112 منشورًا على Facebook وتغريدات Twitter وتحتوي على أكثر من 20،000 تعليق. كان معظم المحتوى المجمع من Facebook ، ولكن من المقرر جمع المزيد من المحتوى من Twitter في انتظار الوصول إلى واجهة برمجة التطبيقات Twitter. تضمن عملية تكبير البيانات التلاعب ببعض عينات البيانات لإنشاء عينات إضافية ولكن مشابهة يمكن استخدامها لتدريب نموذج نهى. بمجرد أن يصل النموذج إلى أعلى درجة F1 ممكنة.',
    },
  },
  data: {
    hateSpeech: 'خطاب الكراهية',
    positiveSpeech: 'خطاب إيجابي',
    unrelated: 'لا علاقة لها بالسياق',
    neutral: 'محايد',
    confidenceScore: 'نقاط الثقة',
    comment: 'التعليق',
    type: 'النوع',
    f1Score: 'نقاط F1',
    downloadResults: 'تنزيل النتائج',
  },

  dashboard: {
    title: 'نهى',
    description:
      'نماذج النصوص لدينا هي أدوات معالجة لغة متقدمة يمكنها إنشاء نص وتصنيفه وتلخيصه بمستويات عالية من التماسك والدقة.',
    steps: {
      step1: {
        name: 'قبل ان تبدا',
        description:
          '1. نص تحليل النموذج باللغة العربية فقط.\n2. من المهم ملاحظة أن نموذج الذكاء الاصطناعي هذا لا يزال تجريبيًا، وقد لا تكون جميع نتائجه واقعية تمامًا.',
      },
      step2: {
        name: 'تحليل النص الخاص بك',
        description: 'ادخل نص باللغة العربية ليتم تحليله.',
        descriptionFile: 'قم بتحميل ملف إذا كان لديك محتوى نصي متعدد.',
      },
    },
    actions: {
      analyze: 'تحليل',
      chooseFile: 'حدد ملف',
      upload: 'ارفع الملف',
      downloadFileTemplate: 'تنزيل نموذج',
    },

    comment: {
      header: 'أدخل التعليق وسياقه',
      content: 'أدخل التعليق',
      context: 'أدخل سياق التعليق',
    },
    fileUpload: {
      header: 'قم بتحميل ملف يشتبه في أنه يحتوي على خطابات كراهية',
      selectFile: 'حدد ملف',
      downloadTempalte: 'تنزيل نموذج',
      selected: 'تم اختيار',
    },
    tab: {
      file: 'ملف',
      comment: 'تعليق',
    },
    submit: 'سلم',
    or: 'أو',
  },

  status: {
    success: 'نجاح',
    failed: 'فشل',
    uploadWasSuccessful: 'تم التحميل بنجاح',
    selectAFileToUpload: 'حدد ملفًا للتحميل',
    commentCantBeEmpty: 'لا يمكن أن يكون التعليق فارغًا',
  },

  login: {
    header: 'تسجيل الدخول إلى نهى',
    withGithub: 'تسجيل الدخول باستخدام GitHub',
    withJosaId: 'تسجيل الدخول باستخدام JOSA ID',
    withMagicEmail: 'أرسل لي رابطًا سحريًا عبر البريد الإلكتروني',
  },

  predictionResult: {
    commentTypeMsg: 'وجدت نهى أن تعليق هذا المنشور هو',
    f1ScoreMsg: 'نهى واثقة بنسبة %%s من نتيجة التوقع.',
    title: 'نتيجة التوقع',
    percentage: 'نسبة مئوية',
    count: 'عدد',
    details: 'تفاصيل',
    charts: {
      1: 'النسبة المئوية لخطاب الكراهية مقابل المحتوى المحايد.',
      2: 'عدد الصفوف التي تحتوي على كلام يحض على الكراهية مقابل الكلام المحايد.',
    },
    importedRows: 'عدد الصفوف المدخلة:',
    fileName: 'التحليل للملف:',
  },

  apiResponse: {
    missingComment: 'بيانات غير صالحة: بيانات مفقودة `comment`',
    missingPost: 'بيانات غير صالحة: بيانات مفقودة `post`',
    commentOnlyContainingNumbers:
      'بيانات غير صالحة: التعليق يحتوي على أرقام فقط',
    postOnlyContainingNumbers: 'بيانات غير صالحة: المنشور يحتوي فقط على أرقام',
    commentContainsEmail:
      'بيانات غير صالحة: التعليق يحتوي على عنوان بريد إلكتروني',
    postContainsEmail:
      'بيانات غير صالحة: المنشور يحتوي على عنوان بريد إلكتروني',
    commentContainsUrl: 'بيانات غير صالحة: التعليق يحتوي على عنوان URL',
    postContainsUrl: 'بيانات غير صالحة: المنشور يحتوي على عنوان URL',
    invalidFileType: 'نوع الملف غير صالح',
    emptyFile: 'يجب أن يحتوي ملف الإدخال على صف واحد على الأقل من البيانات',
    invalidInputData: 'بيانات الإدخال غير صالحة',
    internalError: 'خطأ داخلي',
  },

  misc: {
    readMore: 'اقرأ أكثر',
  },
}
